good-bye-open-source-hello-free-software.org
#
#+TITLE:         Good bye "open source"; hello "free software"
#+AUTHOR:        hellekin <hellekin@gnu.org>
#+DATE:          2013-01-01
#+STARTUP:       fnadjust
#+OPTIONS:       H:8 num:nil toc:nil f:t tags:nil @:t
#+LANGUAGE:      en
#+STYLE:         <link rel="stylesheet" type="text/css" href="style.css" />
#+DESCRIPTION:   30 years of GNU, 15 years of open-source: we still need to fight for freedom
#+KEYWORDS:      freedom, GNU, open-source, anniversary, free software, GPL, technology

15 years ago, Eric S. Raymond published @<tt>Good bye "free software";
hello "open source"@</tt>, that changed the face of the Free Software
community.  In that article, the author defined "the next phase": to
have free software accepted in the corporate world.  15 years later,
/it's time to reposition/.

"Tu cerebro es una máquina a proveer lo que falta." -- Vampii

* Good bye "free software"; hello "open source"                    :noexport:
** Original Article, by Eric S. Raymond

Goodbye, "free software"; hello, "open source"

This is the original call to the community to start using the term
‘open source‘ that I issued on 8 February 1998. The event referred to
in the first paragraph is the 23 January announcement of the Mozilla
source code release. Because this is a historic document, I have fixed
some link drift but haven't re-styled it to match the rest of my site.
Though it has been converted to XHTML rather than HTML classic, except
for this gray box and the RCS date at the bottom it looks pretty much
exactly as it did then. There are Spanish and Indonesian translations
of this document.

After the Netscape announcement broke in January I did a lot of
thinking about the next phase -- the serious push to get "free
software" accepted in the mainstream corporate world. And I realized
we have a serious problem with "free software" itself.

Specifically, we have a problem with the term "free software", itself,
not the concept. I've become convinced that the term has to go.

The problem with it is twofold. First, it's confusing; the term "free"
is very ambiguous (something the Free Software Foundation's propaganda
has to wrestle with constantly). Does "free" mean "no money charged?"
or does it mean "free to be modified by anyone", or something else?

Second, the term makes a lot of corporate types nervous. While this
does not intrinsically bother me in the least, we now have a pragmatic
interest in converting these people rather than thumbing our noses at
them. There's now a chance we can make serious gains in the mainstream
business world without compromising our ideals and commitment to
technical excellence -- so it's time to reposition. We need a new and
better label.

I brainstormed this with some Silicon Valley fans of Linux (including
Larry Augustin of the Linux International board of directors) the day
after my meeting with Netscape (Feb 5th). We kicked around and
discarded several alternatives, and we came up with a replacement
label we all liked: "open source".

We suggest that everywhere we as a culture have previously talked
about "free software", the label should be changed to "open source".
Open-source software. The open-source model. The open source culture.
The Debian Open Source Guidelines. (In pitching this to the corporate
world I'm also going to be invoking the idea of "peer review" a lot.)

And, we should explain publicly the reason for the change. Linus
Torvalds has been saying in "World Domination 101" that the
open-source culture needs to make a serious effort to take the desktop
and engage the corporate mainstream. Of course he's right -- and this
re-labeling, as Linus agrees, is part of the process. It says we're
willing to work with and co-opt the market for our own purposes,
rather than remaining stuck in a marginal, adversarial position.

This re-labeling has since attracted a lot of support (and some
opposition) in the hacker culture. Supporters include Linus himself,
John "maddog" Hall, Larry Augustin, Bruce Perens of Debian, Phil
Hughes of Linux Journal. Opposers include Richard Stallman, who
initially flirted with the idea but now thinks the term "open source"
isn't pure enough.

Bruce Perens has applied to register "open source" as a trademark and
hold it through Software in the Public Interest. The trademark
conditions will be known as the ``Open Source Definition'',
essentially the same as the Debian Free Software Guidelines.

It's crunch time, people. The Netscape announcement changes
everything. We've broken out of the little corner we've been in for
twenty years. We're in a whole new game now, a bigger and more
exciting one -- and one I think we can win.

(A note about usage. In accordance with normal English practice, the
term is "open source" standing alone, but "open-source" used as an
adjective or in compounds; thus, "open-source software".)

(Yes, we're aware of the specialized meaning "open source" has in the
intelligence community. This is a feature, not a bug.)

Eric S. Raymond <esr@snark.thyrsus.com>

** Point by Point
*** The Next Phase: Acceptance of Free Software in the Corporate World

    - The 1998 article defines "=the next phase=" as: =the serious
      push to get "free software" accepted in the mainstream corporate
      world.=
    - It proposes the thesis that to achieve "the next phase", =we
      have a serious problem with "free software" itself.=
    - =Specifically, we have a problem with the term "free software",
      itself, not the concept.=
    - The author proposes to get rid of the term. =I've become
      convinced that the term has to go.=

*** A Double Problem

    =The problem with it is twofold.=

**** Ambiguity and Confusion

:     First, it's confusing; the term "free" is very ambiguous
:     (something the Free Software Foundation's propaganda has to
:     wrestle with constantly). Does "free" mean "no money charged?" or
:     does it mean "free to be modified by anyone", or something else?

**** Confusion and Ambiguity

:     Second, the term makes a lot of corporate types nervous.

*** Pragmatic Interest

**** To Make Serious Gains
    - converting =these people= (i.e. "a lot of corporate types" who
      get "nervous" when they hear the term "free software".)
      - vs. =thumbing our noses at them=
    - to =make serious gains in the maintstream business world=.

**** Without Compromising
***** Our Ideals
***** Our Commitment to Technical Excellence

*** The Solution
**** A New and Better Label

    =so it's time to reposition. We need a new and better label.=

**** To Reposition

:    We suggest that everywhere we as a culture have previously talked
:    about "free software", the label should be changed to "open source".
:
:    Open-source software. The open-source model. The open source culture.

:    The Debian Open Source Guidelines. (In pitching this to the corporate
:    world I'm also going to be invoking the idea of "peer review" a lot.)

     That one *never* happen, you can't find bad spelling of people's
     favorite pets in the Debian project, but the *DFSG*: Debian =Free
     Software= Guidelines.

*** The Justification

    =And, we should explain publicly the reason for the change.=

**** Authority Argument

     =Linus Torvalds has been saying=
     - take the desktop
     - engage in the corporate mainstream

**** Self-Justification

     =Of course he's right -- and this re-labeling, as Linus agrees,
     is part of the process.=

**** Projecting Antagonism

:     [The label] says we're willing to work with and co-opt the market
:     for our own purposes, rather than remaining stuck in a marginal,
:     adversarial position.

**** Showing Off Numbers

:     This re-labeling has since attracted a lot of support (and some
:     opposition) in the hacker culture. Supporters include Linus
:     himself, John "maddog" Hall, Larry Augustin, Bruce Perens of
:     Debian, Phil Hughes of Linux Journal. Opposers include Richard
:     Stallman, who initially flirted with the idea but now thinks the
:     term "open source" isn't pure enough.

**** Ditching "Opposers"

:     Stallman, who initially flirted with the idea but now thinks the
:     term "open source" isn't pure enough.

**** Proof of Goodwill 

:     Bruce Perens has applied to register "open source" as a trademark
:     and hold it through Software in the Public Interest. 

**** More re-branding

:     The trademark conditions will be known as the ``Open Source
:     Definition'', essentially the same as the Debian Free Software
:     Guidelines.

**** Yes, We Can

:     It's crunch time, people. The Netscape announcement changes
:     everything. We've broken out of the little corner we've been in for
:     twenty years. We're in a whole new game now, a bigger and more
:     exciting one -- and one I think we can win.

     20 years + 15 years = now. Time to reposition.

**** Normality

:     (A note about usage. In accordance with normal English practice,
:     the term is "open source" standing alone, but "open-source" used
:     as an adjective or in compounds; thus, "open-source software".)

     If that kind of usage of English reduces the confusion about a
     term, why not use that, instead of re-branding a whole lot of
     labels to lose meaning in the way--especially for the reason of
     *nervousness* over a term that would have been understood as
     opposed to the market *before* the market embraced *FREE*
     services as their main business model--free, as in *GRATIS*.

     A minimalist approach would have been to add a hyphen to the
     original term, and talk about =free-software=: software that
     conveys freedom.

(Yes, we're aware of the specialized meaning "open source" has in the
intelligence community. This is a feature, not a bug.)

Eric S. Raymond <esr@snark.thyrsus.com>


* Looking Back

  In 1998, free software[fn:1] still was marginal. Although widely
  accepted in technical and academic circles, it could not break
  MicrOracSAPple's oligarchy over the corporate world.

** Free Software - Idealism + Marketing = Open Source

   Raymond's article was not a technical article.  It was all about
   marketing[fn:2].  It was about hiding the reason why we're making
   our software free, and focus on its /excellence/; it was about
   turning free software into a commodity, so that corporate people
   would be at ease with the concept.

   In retrospect, that initiative brought positive results with regard
   to its objective to bring free software to the mainstream.  Indeed,
   the Open Source Initiative did a lot to promote open-source
   software to the corporate world, and probably played a key role in
   the acceptance of the technology.  And as far as the reasons
   invoked by ESR in his article are concerned, it completed its task
   beyond expectations.  But there's no reason to believe that same
   results would not have been achieved without a label change.
   
