good-bye-open-source-hello-free-software.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Good bye "open source"; hello "free software"</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Good bye "open source"; hello "free software""/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-01"/>
<meta name="author" content="hellekin &lt;hellekin@cepheide.org&gt;"/>
<meta name="description" content="30 years of GNU, 15 years of open-source: we still need to fight for freedom"/>
<meta name="keywords" content="freedom, GNU, open-source, anniversary, free software, GPL, technology"/>
<link rel="stylesheet" type="text/css" href="style.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Good bye "open source"; hello "free software"</h1>

<p>15 years ago, Eric S. Raymond published <tt>Good bye "free software";
hello "open source"</tt>, that changed the face of the Free Software
community.  In that article, the author defined "the next phase": to
have free software accepted in the corporate world.  15 years later,
<i>it's time to reposition</i>.
</p>
<p>
"Tu cerebro es una máquina a proveer lo que falta." &ndash; Vampii
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Looking Back</h2>
<div class="outline-text-2" id="text-1">


<p>
  In 1998, free software<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup> still was marginal. Although widely
  accepted in technical and academic circles, it could not break
  MicrOracSAPple's oligarchy over the corporate world.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Free Software - Idealism + Marketing = Open Source</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   Raymond's article was not a technical article.  It was all about
   marketing<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>.  It was about hiding the reason why we're making
   our software free, and focus on its <i>excellence</i>; it was about
   turning free software into a commodity, so that corporate people
   would be at ease with the concept.
</p>
<p>
   In retrospect, that initiative brought positive results with regard
   to its objective to bring free software to the mainstream.  Indeed,
   the Open Source Initiative did a lot to promote open-source
   software to the corporate world, and probably played a key role in
   the acceptance of the technology.  And as far as the reasons
   invoked by ESR in his article are concerned, it completed its task
   beyond expectations.  But there's no reason to believe that same
   results would not have been achieved without a label change.
</p>
</div>

</div>
