good-bye-open-source-hello-free-software.org
** From Netscape to Google

   In 1998, Netscape became the big corporate player of the free
   software world.  With the release of Firefox's source code, that
   prompted ESR and others to ditch "free software"--the label.
     
   Then came a whole lot of booming companies using free software and,
   sometimes, promoting it--such as Google; and prominent software
   companies started "open sourcing" their products; the best part of
   the mobile smartphone market runs on free software; and the NSA
   itself, the world's top employer of mathematicians, released free
   source code to enhance the security of the Linux kernel.  All
   events of the magnitude of the initial public release of Firefox.

   Today, most Internet companies abundantly use free software in
   their core business, some give important contributions back to the
   community, either by code or sponsorship of free software projects;
   beyond academia, use of free software became law in governments,
   such as Iceland, Brazil, Ecuador[fn:3], Germany, Venezuela, or
   more recently Uruguay...

   Today, the "fear of free software" is gone, and around the world,
   individuals, businesses and governments embrace software freedom,
   for its excellence, and for other reasons that we're going to
   address.

* Why Is Freedom Important?

  Everyone has at least a good reason to prefer software freedom over
  non-free software products.

  Individuals may want to keep their computing activity in line with
  their ethics, customize software to meet their specific needs; share
  it with their friends, or keep their purchased books off the
  censorship hook of some +over-sized+ misanthropic company.

  Businesses may want to cut on the costs of setup and maintenance,
  benefit from the large and efficient community that will fix bugs as
  soon as possible, and keep open the possibility of tailoring the
  functionality, or producing software themselves, at a fraction of
  the cost of proprietary equivalents.

  Governments may want to keep a foreign company from operating
  potentially malicious software within their own infrastructure, and
  control their own software production, and guarantee the sovereignty
  of their State.

  Each of these points could have been deemed unnecessary, or even
  paranoid, 15 years ago.  But since, we've had Wikileaks, Anonymous,
  forged SSL certificates, Stuxnet, Red October, an illegal war in
  Iraq, Homeland Security, RFID chips, bugged and remotely controlled
  smartphones, etc.  Corporate intelligence and digital warfare are
  not science-fiction anymore: they are facts, and prime time news.
  And "nervous corporate types" do know that paying a license fee will
  not protect their datacenter against a determined attacker, maybe
  even the opposite, given the track record of proprietary software
  insecurity.

  But, it can't be for convenience, or cutting costs, or security that
  we're insisting on software freedom.  So, why is freedom so
  important?

** The Ambiguity of "free"

   In the ambiguity of the English term "free", ESR and the
   open-source proponents' find their main argument to avoid it: it
   could mean gratis or it could mean empty; why the hell would it
   mean /libre/[fn:4]?

   It transpires from ESR's text that the double-meaning of
   free-gratis, and free-not-owned would eclipse the usual meaning of
   freedom.  Indeed, the declared objective is to reassure the
   markets, and give a serious--as in non-activist--tone to free
   software.

   It is unfortunate that ESR himself did not (want to) realize the
   mistake he made when stating that free software remained "stuck in
   a marginal, adversarial position", antagonist to commerce.  It was
   not then, and is not now: free software *is* free! You are free to
   do business with it, including selling copies of the
   software[fn:5], although the main business model associated to free
   software is one of service.

   Now "free" built another reputation during this period. After a
   decade or more of "free" online services, "free" not only sounds
   like "gratis", but also like a trap: if a product is "free", then
   the product being sold is *you*.

   It's time to assert the meaning of free we're seeking, rather than
   to hide it.  There's no ground in letting hostile parties take over
   the meaning of our own words.  Free, used well, is not replaceable;
   and nobody will argue with the meaning of /free/ in the First and
   Fourth amendments to the U.S. Constitution; Liberté, Egalité,
   Fraternité does not leave any ambiguity as to the meaning of
   Liberté: it's freedom. Period.[fn:6]

** It's About an Ontology of Freedom

   Following the tragic September 11, 2001, the dominating powers
   tried to redefine the meaning of freedom in an Orwellian style:
   freedom would mean that the more powerful can do whatever they want
   in the name of freedom, including killing civilians, children, and
   assassinating people without a trial, under the cover of
   anti-terrorism. That "freedom" would mean that you cannot stop
   financial elites from massively robbing the people, and you cannot
   prevent a company that sold you a book-reader from removing your
   books from it. That "freedom" would mean the right to remain
   silent, and to be opposed any word you may say, and that *is*
   recorded. That "freedom" would mean the right to commit suicide to
   avoid persecution from a hostile government that represses
   freedom-of-speech-against-it. That "freedom" would mean
   slavery. That "freedom" is but a label that denies freedom.

   So, if freedom became such an empty shell, why keep using it?  It's
   not about labels, it has never been about labels[fn:7]. But the
   struggle, today and before, concerns freedom[fn:8], the
   concept. It's difficult to define by words[fn:9], but can easily be
   understood by illustration. It's not a matter of marketing, but a
   matter of ethics; not a matter of semiotics, but a work of
   ontology.

   The freedom I believe in is one cooperatively evolving from the
   co-learning of all humans, across Centuries and cultures, in
   addressing ignorance, domination, corruption, malevolence;
   Prometheus brought us freedom, by dissipating the dark veil of
   ignorance, and appeasing the fear born from it. My freedom is one
   of science, one of sharing, one of history. My freedom is never
   attained, and always endangered by conservative forces. My freedom
   knows no boundaries but one: your lack of freedom.

