good-bye-open-source-hello-free-software.org
* The Next Phase

  So it's time to reposition. We need to get back to the roots.

  Open-source vs. Free Software has a bitter taste of Us
  vs. Them. Truth is: we're one big family, on one little planet, and
  competition won't lead us anywhere else--at least not any time soon,
  and we have more urgent problems to tackle than to ponder the next
  Faster-Than-Light travel engine.

  The layman starts understanding the importance of transparency in
  public processes: the United Nations made it a point to recognize
  Internet access as a Human Right, but free software does not enjoy
  such recognition yet; Wikileaks keeps demonstrating the proprietary
  secrets of publicly-funded governments' covert ops[fn:10]; and as more
  unethical practices unfold in the media, the awareness of the
  general public raises sharply about the ethics of foreign policies
  and globalized businesses.

  More than ever, we need freedom. If we ever want to live in a world
  beyond short-term-profit, we need to expose and address global
  issues globally.  In order to achieve such a Global Brain magnitude
  of human interaction, we need to embrace computing as a mind
  amplifier, alike the Computer Science and Internet pioneers.

  In the next few years, as the old world is still rushing at full
  speed toward a solid wall, geo-strategic tensions will increase.
  How to ensure that these tensions are mostly resolved
  diplomatically, rather than warily?  There's no definite answer to
  that, but some hints inherited from History:

    - powerful individual action depends on individual freedom
    - powerful social action depends on social freedom
    - correct decision making depends on the availability of relevant
      information
    - dominant forces want to keep dominating, and will use any means
      to stay in place
    - cooperation favors intelligence

* Free Software as a Specific Technology

  What can free software do, that non-free software cannot achieve?
  
  An obvious answer to that question is: "free software gives you
  freedom!"[fn:11]

  A less obvious answer relates to the very nature of free software, as
  distinguished from non-free software: there lies not a technical
  difference, but a technological difference.  Free software is a
  distinguishable technology from non-free software.

  According to Gilbert Simondon's Theory of Individuation[fn:12], the means
  of production of an arbitrary technique are deeply rooted into the
  resulting technology ; any open-ended technology can evolve in
  unexpected, and unintended ways ; quality comes by successive
  iterations ; a complex network of simple elements is more fit than
  any static construction (made for a particular purpose) ; etc.

  All of this sounds like free software: from the Unix philosophy to
  "write programs that do one thing and do it well. Write programs to
  work together. Write programs to handle text streams, because that
  is a universal interface"[fn:13], to the distributed and iterative
  development model, free software is a good candidate for being a
  distinct technology from non-free software.

  First of all, free software guarantees user's freedom to run, copy,
  change, and share original or modified copies of the software. The
  "four freedoms" make free software essentially public; and as the
  software evolves, a *copyleft* [fn:14] free software license tries to
  guarantee that it will remain free.

  Free software, like non-free software, operates within the legal
  framework of Copyright: it has an author, and, unlike non-free
  software, that author grants rights to use, study, share, and change
  the software, that are irrevocable in the case of copylefted free
  software.

  That makes copylefted free software particularly well-suited for
  developing a public infrastructure: its development is driven by the
  needs of the user, and its strong Copyright policy makes it
  available to the public, once and for all. Its development model
  also fosters creativity, by allowing anyone with an idea to
  implement it and propose it to the public: marketing is much less
  important here than excellence of the product; like Science, free
  software relies on peer-review to test its quality and pertinence,
  and does not impose blind trust on its users, like non-free software
  does.

  One of the less technical aspects of software freedom, its reliance
  on community, also provides a foundation for cooperation in its
  development: businesses and institutions can share their
  developments and make the software evolve in ways that are simply
  not possible with non-free software.

  Moreover, free software fosters competition and diversity, where
  non-free software tends to favor monopolies, and industrial
  secrets--or software patents--that block innovation. But with the
  source code in hand, anything is possible.

  Finally, free software allows flexible support, that can be done
  in-house, or by a chosen service provider. In contrast, usually, the
  normalization of non-free software support makes it difficult or
  impossible to adapt to specific needs of the user.

** TODO                                                            :noexport:

*** the means of production...

    of an arbitrary technique are deeply rooted into the
    resulting technology

*** any open-ended technology

    can evolve in unexpected, and unintended ways

*** quality comes by successive iterations

    

*** a complex network of simple elements is more fit

    than any static construction (made for a particular purpose)

    - Internet!

* Looking Omni-Directionally

  15 years later, free software has reached its goal of embracing the
  market, and becoming a mainstream technology; and, we're still
  talking about the Debian Free Software Guidelines.  As globalization
  continues, it makes more acute the failures and shortcomings of
  democracy, and the fallacy of "free" markets.  People around the
  world want, and need more freedom, now: all of you, all of us,
  deserve it[fn:15].

  *Free software gives you freedom* and it's time to insist (again) on
  that specificity.  The GNU project[fn:16] is turning 30 years old
  this year: make it so that 2013 be the year of software freedom.

  Happy birthday GNU!

  Thank you open-source, you served well. Welcome back, free software!

* Post-Amble                                                       :noexport:
:postamble

  This article is evolving.

  There are follow-ups, and the list of footnotes grows to link
  informational references.

  LibrECO the Libre Economic Cooperative Ontology defines business
  models adapted to the goals and ethics of freedom.  Based on proven
  experience, they foster a model where individual freedom provides a
  significant improvement in the shared experience of human
  relationships. As a result, the organization can achieve better
  results and trigger disruptive innovation in their industries. That
  includes a cooperative supply chain community model, where
  producers, suppliers, and consumers have their say on the strategy
  of the enterprise[fn:17].

** Media Resources

   - https://fosdem.org/2013/schedule/event/freedombox/
   - 

* Changes                                                          :noexport:

  Since Publication, I incorporated comments and suggestions by Micah
  Andersson, Richard M. Stallman, Erkan Yilmaz.

  - Thank you Micah for pointing out ...
  - Thank you ... for the pointer to WikiEducator
  - Thank you Richard for your invaluable editing skills
  - Thank you Erkan for ...

*                                                                 :meta:
  :PROPERTIES:
  :VISIBILITY: children
  :END:

#+BEGIN_HTML
<div class="copyleft">
#+END_HTML

Copyright 2013 hellekin <[[mailto:hellekin@cepheide.org][hellekin.cepheide.org]]>
—
Verbatim copying and distribution of this entire
article are permitted worldwide, without royalty, in any medium,
provided this notice is preserved.
#+END_HTML

You can [[http://cepheide.org/consensus/good-bye-open-source-hello-free-software.org][copy the text source]] that produced this HTML file.

This article is maintained in a [[https://github.com/hellekin/writings][public Git repository]].

#+BEGIN_HTML
</div>
#+END_HTML

