good-bye-open-source-hello-free-software.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Next Phase</h2>
<div class="outline-text-2" id="text-3">


<p>
  So it's time to reposition. We need to get back to the roots.
</p>
<p>
  Open-source vs. Free Software has a bitter taste of Us
  vs. Them. Truth is: we're one big family, on one little planet, and
  competition won't lead us anywhere else&ndash;at least not any time soon,
  and we have more urgent problems to tackle than to ponder the next
  Faster-Than-Light travel engine.
</p>
<p>
  The layman starts understanding the importance of transparency in
  public processes: the United Nations made it a point to recognize
  Internet access as a Human Right, but free software does not enjoy
  such recognition yet; Wikileaks keeps demonstrating the proprietary
  secrets of publicly-funded governments' covert ops<sup><a class="footref" name="fnr.10" href="#fn.10">10</a></sup>; and as more
  unethical practices unfold in the media, the awareness of the
  general public raises sharply about the ethics of foreign policies
  and globalized businesses.
</p>
<p>
  More than ever, we need freedom. If we ever want to live in a world
  beyond short-term-profit, we need to expose and address global
  issues globally.  In order to achieve such a Global Brain magnitude
  of human interaction, we need to embrace computing as a mind
  amplifier, alike the Computer Science and Internet pioneers.
</p>
<p>
  In the next few years, as the old world is still rushing at full
  speed toward a solid wall, geo-strategic tensions will increase.
  How to ensure that these tensions are mostly resolved
  diplomatically, rather than warily?  There's no definite answer to
  that, but some hints inherited from History:
</p>
<ul>
<li>powerful individual action depends on individual freedom
</li>
<li>powerful social action depends on social freedom
</li>
<li>correct decision making depends on the availability of relevant
      information
</li>
<li>dominant forces want to keep dominating, and will use any means
      to stay in place
</li>
<li>cooperation favors intelligence
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Free Software as a Specific Technology</h2>
<div class="outline-text-2" id="text-4">


<p>
  What can free software do, that non-free software cannot achieve?
</p>
<p>  
  An obvious answer to that question is: "free software gives you
  freedom!"<sup><a class="footref" name="fnr.11" href="#fn.11">11</a></sup>
</p>
<p>
  A less obvious answer relates to the very nature of free software, as
  distinguished from non-free software: there lies not a technical
  difference, but a technological difference.  Free software is a
  distinguishable technology from non-free software.
</p>
<p>
  According to Gilbert Simondon's Theory of Individuation<sup><a class="footref" name="fnr.12" href="#fn.12">12</a></sup>, the means
  of production of an arbitrary technique are deeply rooted into the
  resulting technology ; any open-ended technology can evolve in
  unexpected, and unintended ways ; quality comes by successive
  iterations ; a complex network of simple elements is more fit than
  any static construction (made for a particular purpose) ; etc.
</p>
<p>
  All of this sounds like free software: from the Unix philosophy to
  "write programs that do one thing and do it well. Write programs to
  work together. Write programs to handle text streams, because that
  is a universal interface"<sup><a class="footref" name="fnr.13" href="#fn.13">13</a></sup>, to the distributed and iterative
  development model, free software is a good candidate for being a
  distinct technology from non-free software.
</p>
<p>
  First of all, free software guarantees user's freedom to run, copy,
  change, and share original or modified copies of the software. The
  "four freedoms" make free software essentially public; and as the
  software evolves, a <b>copyleft</b> <sup><a class="footref" name="fnr.14" href="#fn.14">14</a></sup> free software license tries to
  guarantee that it will remain free.
</p>
<p>
  Free software, like non-free software, operates within the legal
  framework of Copyright: it has an author, and, unlike non-free
  software, that author grants rights to use, study, share, and change
  the software, that are irrevocable in the case of copylefted free
  software.
</p>
<p>
  That makes copylefted free software particularly well-suited for
  developing a public infrastructure: its development is driven by the
  needs of the user, and its strong Copyright policy makes it
  available to the public, once and for all. Its development model
  also fosters creativity, by allowing anyone with an idea to
  implement it and propose it to the public: marketing is much less
  important here than excellence of the product; like Science, free
  software relies on peer-review to test its quality and pertinence,
  and does not impose blind trust on its users, like non-free software
  does.
</p>
<p>
  One of the less technical aspects of software freedom, its reliance
  on community, also provides a foundation for cooperation in its
  development: businesses and institutions can share their
  developments and make the software evolve in ways that are simply
  not possible with non-free software.
</p>
<p>
  Moreover, free software fosters competition and diversity, where
  non-free software tends to favor monopolies, and industrial
  secrets&ndash;or software patents&ndash;that block innovation. But with the
  source code in hand, anything is possible.
</p>
<p>
  Finally, free software allows flexible support, that can be done
  in-house, or by a chosen service provider. In contrast, usually, the
  normalization of non-free software support makes it difficult or
  impossible to adapt to specific needs of the user.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Looking Omni-Directionally</h2>
<div class="outline-text-2" id="text-5">


<p>
  15 years later, free software has reached its goal of embracing the
  market, and becoming a mainstream technology; and, we're still
  talking about the Debian Free Software Guidelines.  As globalization
  continues, it makes more acute the failures and shortcomings of
  democracy, and the fallacy of "free" markets.  People around the
  world want, and need more freedom, now: all of you, all of us,
  deserve it<sup><a class="footref" name="fnr.15" href="#fn.15">15</a></sup>.
</p>
<p>
  <b>Free software gives you freedom</b> and it's time to insist (again) on
  that specificity.  The GNU project<sup><a class="footref" name="fnr.16" href="#fn.16">16</a></sup> is turning 30 years old
  this year: make it so that 2013 be the year of software freedom.
</p>
<p>
  Happy birthday GNU!
</p>
<p>
  Thank you open-source, you served well. Welcome back, free software!
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"></h2>
<div class="outline-text-2" id="text-6">




<div class="copyleft">

<p>
Copyright 2013 hellekin &lt;<a href="mailto:hellekin@cepheide.org">hellekin.cepheide.org</a>&gt;
—
Verbatim copying and distribution of this entire
article are permitted worldwide, without royalty, in any medium,
provided this notice is preserved.
</p>
<p>
You can <a href="http://cepheide.org/consensus/good-bye-open-source-hello-free-software.org">copy the text source</a> that produced this HTML file.
</p>
<p>
This article is maintained in a <a href="https://github.com/hellekin/writings">public Git repository</a>.
</p>


</div>
