good-bye-open-source-hello-free-software.org
* Footnotes

[fn:1] [[https://gnu.org/philosophy/free-sw.html][What is Free Software?]]

[fn:2] "Open Source is a marketing program for Free Software." --
   Bruce Perens, February 18th, 1998, to the [[http://www.crynwr.com/cgi-bin/ezmlm-cgi?mss:1190:199802:medkbdodficknnkdkppb][Free Software Business mailing list]] (FSB)

[fn:3] [[http://prometeo.senescyt.gob.ec/portal/en/web/prometeo][The Prometeo, "Wise Elders" Program]]: Ecuador just launched a
   vast project to promote scientific research in the country, and per
   national policy, free software development and ICT research

[fn:4] [[http://wikieducator.org/Say_Libre][Knowledge for all, freedom to learn, towards collective wisdom for a sustainable world]]

[fn:5] [[https://gnu.org/philosophy/selling.html][Selling Free Software]] is OK!

[fn:6] In French, /libre/ has the same problem as /free/ in English:
both words can mean /gratis/ or /free of charge/. However, /esprit
libre/, /economie libre/, ou /citoyen libre/ are respectively
translated to /free spirit/, /free economy/, and /free citizen/: none
bear the meaning of price. The bad cultural habit of confusing freedom
with comfort is not yet shared globally, but the need for freedom is.

[fn:7] For a history of the labels "free software", "libre software",
   and "open-source software", see the article of Jesus M
   Gonzales-Barahona: [[http://sinetgy.org/jgb/articulos/libre-software-origin/][Quo vadis, libre software?]]

[fn:8] [[https://gnu.org/philosophy/open-source-misses-the-point.html][Why "Open Source" is missing the point of Free Software]]

[fn:9] Richard M Stallman says: I define freedom as "having control
over your own life". (in correspondence, January 28th 2013)

[fn:10] [[http://wlcentral.org/node/2777][Rafael Correa's New South America]], November 23rd, 2012, WLCentral

[fn:11] "[[http://www.crynwr.com/cgi-bin/ezmlm-cgi?mss:1151:199802:lobodkdpljkgkacooaeo][It's Still Free Software]]" -- Richard M. Stallman, February
16th, 1998, to the FSB list

[fn:12] [[http://en.wikipedia.org/wiki/Individuation#Gilbert_Simondon][Wikipedia Article on Individuation]]

[fn:13] [[http://www.faqs.org/docs/artu/ch01s06.html][Basics of Unix Philosophy]]

[fn:14] [[http://www.gnu.org/copyleft/copyleft.html][What is Copyleft?]]

[fn:15] [[https://gnu.org/philosophy/why-free.html][Why Software Should Not Have Owners]]

[fn:16] https://gnu.org/

[fn:17] Premium Cola business model
  - TODO: translate DE -> EN
