good-bye-open-source-hello-free-software.html

<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> <a href="https://gnu.org/philosophy/free-sw.html">What is Free Software?</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> "Open Source is a marketing program for Free Software." --
   Bruce Perens, February 18th, 1998, to the <a href="http://www.crynwr.com/cgi-bin/ezmlm-cgi?mss:1190:199802:medkbdodficknnkdkppb">Free Software Business mailing list</a> (FSB)
</p>


<p class="footnote"><sup><a class="footnum" name="fn.3" href="#fnr.3">3</a></sup> <a href="http://prometeo.senescyt.gob.ec/portal/en/web/prometeo">The Prometeo, "Wise Elders" Program</a>: Ecuador just launched a
   vast project to promote scientific research in the country, and per
   national policy, free software development and ICT research
</p>


<p class="footnote"><sup><a class="footnum" name="fn.4" href="#fnr.4">4</a></sup> <a href="http://wikieducator.org/Say_Libre">Knowledge for all, freedom to learn, towards collective wisdom for a sustainable world</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.5" href="#fnr.5">5</a></sup> <a href="https://gnu.org/philosophy/selling.html">Selling Free Software</a> is OK!
</p>


<p class="footnote"><sup><a class="footnum" name="fn.6" href="#fnr.6">6</a></sup> In French, <i>libre</i> has the same problem as <i>free</i> in English:
both words can mean <i>gratis</i> or <i>free of charge</i>. However, <i>esprit libre</i>, <i>economie libre</i>, ou <i>citoyen libre</i> are respectively
translated to <i>free spirit</i>, <i>free economy</i>, and <i>free citizen</i>: none
bear the meaning of price. The bad cultural habit of confusing freedom
with comfort is not yet shared globally, but the need for freedom is.
</p>


<p class="footnote"><sup><a class="footnum" name="fn.7" href="#fnr.7">7</a></sup> For a history of the labels "free software", "libre software",
   and "open-source software", see the article of Jesus M
   Gonzales-Barahona: <a href="http://sinetgy.org/jgb/articulos/libre-software-origin/">Quo vadis, libre software?</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.8" href="#fnr.8">8</a></sup> <a href="https://gnu.org/philosophy/open-source-misses-the-point.html">Why "Open Source" is missing the point of Free Software</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.9" href="#fnr.9">9</a></sup> Richard M Stallman says: I define freedom as "having control
over your own life". (in correspondence, January 28th 2013)
</p>


<p class="footnote"><sup><a class="footnum" name="fn.10" href="#fnr.10">10</a></sup> <a href="http://wlcentral.org/node/2777">Rafael Correa's New South America</a>, November 23rd, 2012, WLCentral
</p>


<p class="footnote"><sup><a class="footnum" name="fn.11" href="#fnr.11">11</a></sup> "<a href="http://www.crynwr.com/cgi-bin/ezmlm-cgi?mss:1151:199802:lobodkdpljkgkacooaeo">It's Still Free Software</a>" &ndash; Richard M. Stallman, February
16th, 1998, to the FSB list
</p>


<p class="footnote"><sup><a class="footnum" name="fn.12" href="#fnr.12">12</a></sup> <a href="http://en.wikipedia.org/wiki/Individuation#Gilbert_Simondon">Wikipedia Article on Individuation</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.13" href="#fnr.13">13</a></sup> <a href="http://www.faqs.org/docs/artu/ch01s06.html">Basics of Unix Philosophy</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.14" href="#fnr.14">14</a></sup> <a href="http://www.gnu.org/copyleft/copyleft.html">What is Copyleft?</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.15" href="#fnr.15">15</a></sup> <a href="https://gnu.org/philosophy/why-free.html">Why Software Should Not Have Owners</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn.16" href="#fnr.16">16</a></sup> <a href="https://gnu.org/">https://gnu.org/</a>
</p>


</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-01</p>
<p class="author">Author: hellekin &lt;hellekin@cepheide.org&gt;</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
